# Pandas-DataFrame And Series

Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes(rows and columns)

In [1]:
import pandas as pd

In [2]:
data = [1,2,3,4,5]
series= pd.Series(data)
print("Series\n", series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data, index = index)

a    10
b    20
c    30
dtype: int64

In [32]:
## Data frame
## Creating the dataframe from the dictionary of list

data = {
        'Name': ['Uditya', 'Ram', 'Jack'],
        'Age': [20, 25, 30],
        'City': ['Mumbai', 'Jaunpur', 'Bhopal']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age     City
0  Uditya   20   Mumbai
1     Ram   25  Jaunpur
2    Jack   30   Bhopal
<class 'pandas.core.frame.DataFrame'>

In [33]:
df.loc[0]

Name    Uditya
Age         20
City    Mumbai
Name: 0, dtype: object

In [34]:
df.iloc[0]

Name    Uditya
Age         20
City    Mumbai
Name: 0, dtype: object

In [26]:
df = pd.read_csv('current_forecast.csv')

In [28]:
df.head()

,datetime,temp,temp_min,temp_max,humidity,wind_speed,wind_deg,pressure,description,main_weather,feels_like,uv_index,visibility,rain_prob
0,2025-05-07 17:30:00,15.17,14.80,15.17,80,3.20,226,1016,broken clouds,Clouds,14.83,5,10000,0.0
1,2025-05-07 20:30:00,16.13,16.13,18.04,73,3.21,221,1016,broken clouds,Clouds,15.70,5,10000,0.0
2,2025-05-07 23:30:00,19.50,19.50,21.67,57,4.23,189,1015,broken clouds,Clouds,18.99,5,10000,0.0
3,2025-05-08 02:30:00,20.06,20.06,20.06,47,3.40,248,1014,overcast clouds,Clouds,19.35,5,10000,0.0
4,2025-05-08 05:30:00,18.43,18.43,18.43,57,3.90,258,1015,overcast clouds,Clouds,17.82,5,10000,0.0

In [29]:
df['temp']

0     15.17
1     16.13
2     19.50
3     20.06
4     18.43
5     18.17
6     16.58
7     15.45
8     16.90
9     20.74
10    22.40
11    20.91
12    17.00
13    16.44
14    16.12
15    14.91
16    14.11
17    13.59
18    12.35
19    17.17
20    14.07
21    12.05
22    10.34
23     9.80
24    11.40
25    16.83
26    20.43
27    21.14
28    18.74
29    17.09
30    16.04
31    15.22
32    16.33
33    20.69
34    21.85
35    20.77
36    17.35
37    16.54
38    15.47
39    14.35
Name: temp, dtype: float64

In [30]:
## Selecting the row we use the loc function
df.loc[0]

datetime        2025-05-07 17:30:00
temp                          15.17
temp_min                       14.8
temp_max                      15.17
humidity                         80
wind_speed                      3.2
wind_deg                        226
pressure                       1016
description           broken clouds
main_weather                 Clouds
feels_like                    14.83
uv_index                          5
visibility                    10000
rain_prob                       0.0
Name: 0, dtype: object

In [31]:
## Selecting the columns we use the iloc function
df.iloc[0]

datetime        2025-05-07 17:30:00
temp                          15.17
temp_min                       14.8
temp_max                      15.17
humidity                         80
wind_speed                      3.2
wind_deg                        226
pressure                       1016
description           broken clouds
main_weather                 Clouds
feels_like                    14.83
uv_index                          5
visibility                    10000
rain_prob                       0.0
Name: 0, dtype: object

In [36]:
df

     Name  Age     City
0  Uditya   20   Mumbai
1     Ram   25  Jaunpur
2    Jack   30   Bhopal

In [37]:
df.at[1, 'Age']

np.int64(25)

In [38]:
df.at[1, 'Name']

'Ram'

In [39]:
df.iat[2,2]

'Bhopal'

In [ ]:
### Data manipulation with dataFrame
## Adding the column

df['Salary'] = [2300,23000, 4500]

In [41]:
df

     Name  Age     City  Salary
0  Uditya   20   Mumbai    2300
1     Ram   25  Jaunpur   23000
2    Jack   30   Bhopal    4500

In [43]:
 ## remove the column
df.drop('Salary', axis=1)    # axis = 1 define to search in the columns and the axis=0 is define to search in the row

     Name  Age     City
0  Uditya   20   Mumbai
1     Ram   25  Jaunpur
2    Jack   30   Bhopal

In [44]:
df

     Name  Age     City  Salary
0  Uditya   20   Mumbai    2300
1     Ram   25  Jaunpur   23000
2    Jack   30   Bhopal    4500

In [46]:
## for changing the permanent change is the data we have to write down the  inplace = True
df.drop('Salary', axis= 1, inplace = True)

In [47]:
df

     Name  Age     City
0  Uditya   20   Mumbai
1     Ram   25  Jaunpur
2    Jack   30   Bhopal

In [48]:
## Add age to the column
df['Age'] = df['Age']+10

In [49]:
df

     Name  Age     City
0  Uditya   30   Mumbai
1     Ram   35  Jaunpur
2    Jack   40   Bhopal

In [51]:
df.describe()

        Age
count   3.0
mean   35.0
std     5.0
min    30.0
25%    32.5
50%    35.0
75%    37.5
max    40.0